Repository: pypi-data/pypi-mirror-77
Catalog: packages/Red-DiscordBot/Red_DiscordBot-3.3.12-py3-none-any.whl/redbot/core/locales/*.po
Languages: ru_ru

source: Can't pay for this command in DM without a global bank.
ru_ru: Не удается оплатить эту команду в DM без глобального банка.

source: You need at least {cost} {currency} to use this command.
ru_ru: Вам нужно как минимум {cost} {currency} для того чтобы использовать данную команду.

source: Commands to interface with Red's cog manager.
ru_ru: Команды для интерфейса с менеджером плагинов Red.

source: \n Lists current cog paths in order of priority.\n
ru_ru: \n Список текущих путей плагинов в порядке приоритета.\n

source: Install Path: {install_path}\nCore Path: {core_path}\n\n
ru_ru: Путь установки: {install_path}\nОсновной путь: {core_path}\n\n

source: \n Add a path to the list of available cog paths.\n
ru_ru: \n Добавить путь к списку путей доступных плагинов.\n

source: That path does not exist or does not point to a valid directory.
ru_ru: Этот путь не существует или не указывает на допустимый каталог.

source: Path successfully added.
ru_ru: Путь успешно добавлен.

source: \n Removes a path from the available cog paths given the `path_number` from `[p]paths`.\n
ru_ru: \n Удаляет путь из доступных путей Cog, учитывая `path_number` от `[p]paths`.\n

source: Path numbers must be positive.
ru_ru: Номера путей должны быть положительными.

source: That is an invalid path number.
ru_ru: Это неверный номер пути.

source: Path successfully removed.
ru_ru: Путь успешно удален.

source: \n Reorders paths internally to allow discovery of different cogs.\n
ru_ru: \n Внутреннее изменение порядка путей, позволяющие обнаруживать различные плагины.\n

source: Invalid 'from' index.
ru_ru: Недопустимый индекс 'от'.

source: Invalid 'to' index.
ru_ru: Недопустимый индекс 'в'.

source: Paths reordered.
ru_ru: Пути переупорядочены.

source: \n Returns the current install path or sets it if one is provided.\n The provided path must be absolute or relative to the bot's\n directory and it must already exist.\n\n No installed cogs will be transferred in the process.\n
ru_ru: \n Возвращает текущий путь установки или устанавливает его, если он указан.\n Указанный путь должен быть абсолютным или относительным к каталогу\n бота, и он должен уже существовать.\n\n Никакие установленные плагины не будут переданы в процессе.\n

source: That path does not exist.
ru_ru: Этого пути не существует.

source: The bot will install new cogs to the `{}` directory.
ru_ru: Бот будет устанавливать новые плагины в директорию `{}`.

source: \n Lists all loaded and available cogs.\n
ru_ru: \n Список всех загруженных и доступных плагинов.\n

source: **{} loaded:**\n
ru_ru: **{} загружен:**\n

source: **{} unloaded:**\n
ru_ru: **{} выгружен:**\n

source: Commands related to core functions
ru_ru: Команды, связанные с основными функциями

source: Shows info about Red
ru_ru: Показывает информацию о Red

source: This bot is an instance of [Red, an open source Discord bot]({}) created by [Twentysix]({}) and [improved by many]({}).\n\nRed is backed by a passionate community who contributes and creates content for everyone to enjoy. [Join us today]({}) and help us improve!\n\n(c) Cog Creators
ru_ru: Этот бот является примером [Red, открытый бот Discord]({}) сделано [Twentysix]({}) и [улучшено многими]({}).\n\nRed поддерживается страстным сообществом, которое вносит свой вклад и создает контент для всех желающих. [Присоединяйтесь к нам сегодня]({}) и помогите нам улучшить!\n\n(c) Cog Creators

source: Instance owned by
ru_ru: Данная копия принадлежит

source: Red version
ru_ru: Версия Red бота

source: Yes, {version} is available.
ru_ru: Да, {version} доступен.

source: Checking for updates failed.
ru_ru: Проверка обновлений не удалась.

source: Outdated
ru_ru: Устаревшие

source: About this instance
ru_ru: Об этом экземпляре

source: About Red
ru_ru: О Red

source: Bringing joy since 02 Jan 2016 (over {} days ago!)
ru_ru: Приносит радость с 2 Января 2016 (более {} дней назад!)

source: Shows [botname]'s uptime
ru_ru: Показать [botname] время безотказной работы

source: Less than one second
ru_ru: Менее одной секунды

source: Been up for: **{time_quantity}** (since {timestamp} UTC)
ru_ru: Был за: **{time_quantity}** (поскольку {timestamp} универсальное глобальное время)

source: \n Commands for toggling embeds on or off.\n\n This setting determines whether or not to\n use embeds as a response to a command (for\n commands that support it). The default is to\n use embeds.\n
ru_ru: \n Команды для включения или выключения встраиваемых сообщений.\n\n Этот параметр определяет, использовать ли встраиваемые сообщения\n в качестве ответа на команду (для команд, которые ее поддерживают).\n По умолчанию используются встраиваемые сообщения.\n

source: Embed settings:\n\n
ru_ru: Настройка эмбеддов:\n\n

source: Global default: {}\n
ru_ru: Глобальные значения по умолчанию: {}\n

source: Guild setting: {}\n
ru_ru: Настройки гильдии: {}\n

source: Channel setting: {}\n
ru_ru: Настройка канала: {}\n

source: User setting: {}
ru_ru: Настройки пользователя: {}

source: \n Toggle the global embed setting.\n\n This is used as a fallback if the user\n or guild hasn't set a preference. The\n default is to use embeds.\n
ru_ru: \n Переключите настройку глобальных Эмбедов.\n\n Это используется как запасной вариант, если пользователь или\n Guild не установили предпочтение. По умолчанию используется\n embed.\n

source: Embeds are now {} by default.
ru_ru: Встраиваемые теперь по умолчанию {}.

source: disabled
ru_ru: отключен

source: enabled
ru_ru: включен

source: \n Toggle the guild's embed setting.\n\n If enabled is None, the setting will be unset and\n the global default will be used instead.\n\n If set, this is used instead of the global default\n to determine whether or not to use embeds. This is\n used for all commands done in a guild channel except\n for help commands.\n
ru_ru: \n Переключить настройку встраиваемых сообщений гильдии.\n\n Если для параметра Enabled не установлено\n значение, настройка будет отменена, и вместо\n нее будет использоваться глобальное значение\n по умолчанию.\n\n Если установлено, оно будет использоваться вместо\n глобального значения по умолчанию, чтобы определить,\n следует ли использовать встраиваемые сообщения. Оно используется для всех команд, выполняемых в канале гильдии, кроме команд справки\n

source: Embeds will now fall back to the global setting.
ru_ru: Настройки теперь восстанавливаются.

source: Embeds are now {} for this guild.
ru_ru: Настройки {} для этой гильдии.

source: \n Toggle the channel's embed setting.\n\n If enabled is None, the setting will be unset and\n the guild default will be used instead.\n\n If set, this is used instead of the guild default\n to determine whether or not to use embeds. This is\n used for all commands done in a channel except\n for help commands.\n
ru_ru: \n Переключите настройку встраивания канала.\n\n Если включено None, настройка будет сброшена и\n вместо этого будет использоваться гильдия по умолчанию.\n\n Если установлено, используется вместо гильдии по умолчанию\n определить, использовать ли встраивание или нет. Это\n используется для всех команд, выполненных в канале, кроме\n для справочных команд.\n

source: Embeds are now {} for this channel.
ru_ru: Сейчас встраиваются {} для этого канала.

source: Sends to the owner the last command exception that has occurred\n\n If public (yes is specified), it will be sent to the chat instead
ru_ru: Отправляет владельцу последние команды, за исключением\n\n Если публично (указано "yes"), оно будет отправлено в чат

source: No exception has occurred yet
ru_ru: Пока еще ничего не произошло

source: Show's [botname]'s invite url
ru_ru: Url приглашения пользователя [botname]

source: Setup the bot's invite
ru_ru: Настроить приглашения бота

source: \n Define if the command should be accessible for the average user.\n
ru_ru: \n Определите, должна ли команда быть доступной для обычного пользователя.\n

source: Leaves server
ru_ru: Покинуть сервер

source: Are you sure you want me to leave this server? (y/n)
ru_ru: Вы уверены, что хотите, чтобы я покинул данный сервер? (y/n)

source: Response timed out.
ru_ru: Время ответа истекло.

source: Alright. Bye :wave:
ru_ru: Хорошо. До свидания :wave:

source: Leaving guild '{}'
ru_ru: Выход из гильдии '{}'

source: Alright, I'll stay then :)
ru_ru: Хорошо, тогда я остаюсь :)

source: Lists and allows to leave servers
ru_ru: Список серверов и разрешение покинуть их

source: To leave a server, just type its number.
ru_ru: Чтобы покинуть сервер, просто наберите его номер.

source: I cannot leave a guild I am the owner of.
ru_ru: Я не могу покинуть гильдию, которой я владею.

source: Are you sure you want me to leave {}? (yes/no)
ru_ru: Вы уверены, что хотите чтобы я вышел {}? (да/нет)

source: Done.
ru_ru: Готово.

source: Alright then.
ru_ru: Хорошо.

source: Loads packages
ru_ru: Загружает пакеты

source: Loaded {packs}.
ru_ru: Загружено {packs}.

source: The following package is already loaded: {pack}
ru_ru: Следующий пакет уже загружен: {pack}

source: The following packages are already loaded: {packs}
ru_ru: Следующие пакеты уже загружены: {packs}

source: Failed to load the following package: {pack}.\nCheck your console or logs for details.
ru_ru: Не удалось загрузить следующие пакеты: {pack}.\n. Проверьте консоль или логи для более точных деталей.

source: Failed to load the following packages: {packs}\nCheck your console or logs for details.
ru_ru: Не удалось загрузить следующие пакеты: {packs}.\n. Проверьте консоль или логи для более точных деталей.

source: The following package was not found in any cog path: {pack}.
ru_ru: Следующий пакет не найден в пути ког: {pack}.

source: The following packages were not found in any cog path: {packs}
ru_ru: Следующие пакеты не были найдены в пути ког: {packs}

source: This package could not be loaded for the following reason:\n\n{reason}
ru_ru: Этот пакет не может быть загружен по следующим причинам:\n\n{reason}

source: These packages could not be loaded for the following reasons:\n\n{reasons}
ru_ru: Эти пакеты не могут быть загружены по следующим причинам:\n\n{reasons}

source: Unloads packages
ru_ru: Выгружает пакеты

source: The following package was unloaded: {pack}.
ru_ru: Следующий пакет был выгружен: {pack}.

source: The following packages were unloaded: {packs}.
ru_ru: Следующие пакеты были выгружены: {packs}.

source: The following package was not loaded: {pack}.
ru_ru: Не удалось загрузить следующий пакет: {pack}.

source: The following packages were not loaded: {packs}.
ru_ru: Следующие пакеты не были загружены: {packs}.

source: Reloads packages
ru_ru: Перезагружает пакеты

source: Reloaded {packs}.
ru_ru: Перезагрузка {packs}.

source: Failed to reload the following package: {pack}.\nCheck your console or logs for details.
ru_ru: Не удалось перезагрузить следующий пакет: {pack}.\nПроверьте консоль или логи для получения подробностей.

source: Failed to reload the following packages: {packs}\nCheck your console or logs for details.
ru_ru: Не удалось перезагрузить следующие пакеты: {packs}\nПроверьте консоль или журналы для получения информации.

source: This package could not be reloaded for the following reason:\n\n{reason}
ru_ru: Этот пакет не может быть перезагружен по следующей причине:\n\n{reason}

source: These packages could not be reloaded for the following reasons:\n\n{reasons}
ru_ru: Эти пакеты не могут быть перезагружены по следующим причинам:\n\n{reasons}

source: Shuts down the bot
ru_ru: Выключает бота

source: Shutting down...
ru_ru: Завершение работы...

source: Attempts to restart Red\n\n Makes Red quit with exit code 26\n The restart is not guaranteed: it must be dealt\n with by the process manager in use
ru_ru: Попытки перезагрузить Red\n\n Завершает работу Red с кодом выхода 26\n Перезапуск не гарантирован: он должен\n обрабатываться используемым менеджером процессов

source: Restarting...
ru_ru: Перезапуск...

source: Changes [botname]'s settings
ru_ru: Изменяет настройки [botname]

source: Admin roles: {admin}\nMod roles: {mod}\n
ru_ru: Роли администратора: {admin}\nРоли модов: {mod}\n

source: Same as bot's locale
ru_ru: Тот же локализация как у бота

source: Set the delay until the bot removes the command message.\n\n Must be between -1 and 60.\n\n Set to -1 to disable this feature.\n
ru_ru: Установите задержку, пока бот не удалит командное сообщение.\n\n Должно быть между -1 и 60.\n\n Установите -1, чтобы отключить эту функцию.\n

source: Command deleting disabled.
ru_ru: Удаление команды отключено.

source: Delete delay set to {num} seconds.
ru_ru: Удалить задержку, установленную на {num} секунд.

source: Bot will delete command messages after {num} seconds. Set this value to -1 to stop deleting messages
ru_ru: Бот удалит командные сообщения через {num} секунд. Установите это значение -1, чтобы прекратить удаление сообщений

source: I will not delete command messages.
ru_ru: Я не буду удалять командные сообщения.

source: \n Sets the bot's description.\n Use without a description to reset.\n This is shown in a few locations, including the help menu.\n\n The default is \"Red V3\"\n
ru_ru: \n Устанавливает описание бота.\n Используйте без описания для сброса.\n Это показано в нескольких местах, включая меню справки.\n\n По умолчанию \"Red V3\"\n

source: Description reset.
ru_ru: Описание сброшено.

source: This description is too long to properly display. Please try again with below 250 characters
ru_ru: Это описание слишком длинное для правильного отображения. Пожалуйста, попробуйте еще раз с ниже 250 символов

source: \n Adds an admin role for this guild.\n
ru_ru: \n Добавляет роль администратора для этого гильдии.\n

source: This role is already an admin role.
ru_ru: Эта роль уже является администратором.

source: That role is now considered an admin role.
ru_ru: Теперь эта роль рассматривается как роль администратора.

source: \n Adds a mod role for this guild.\n
ru_ru: \n Добавляет роль модератора для этой гильдии.\n

source: This role is already a mod role.
ru_ru: Эта роль уже является модераторской.

source: That role is now considered a mod role.
ru_ru: Эта роль теперь считается ролью мода.

source: \n Removes an admin role for this guild.\n
ru_ru: \n Удаляет роль администратора для этой гильдии.\n

source: That role was not an admin role to begin with.
ru_ru: Эта роль не была ролью администратора, с которой она начала.

source: That role is no longer considered an admin role.
ru_ru: Эта роль больше не рассматривается как роль администратора.

source: \n Removes a mod role for this guild.\n
ru_ru: \n Удаляет роль модератора для этого сервера.\n

source: That role was not a mod role to begin with.
ru_ru: Эта роль не была модераторской ролью для начала.

source: That role is no longer considered a mod role.
ru_ru: Эта роль больше не рассматривается как роль модератора.

source: \n Toggle whether to use the bot owner-configured colour for embeds.\n\n Default is to use the bot's configured colour.\n Otherwise, the colour used will be the colour of the bot's top role.\n
ru_ru: \n Переключите, использовать ли цвет, настроенный владельцем бота, для встраивания.\n\n По умолчанию используется настроенный цвет бота.\n В противном случае используемый цвет будет цветом главной роли бота.\n

source: The bot {} use its configured color for embeds.
ru_ru: Бот {} использовать свой настроенный цвет для встраивания сообщений.

source: will not
ru_ru: не будет

source: will
ru_ru: будет

source: \n Toggle whether to enable fuzzy command search for the server.\n\n Default is for fuzzy command search to be disabled.\n
ru_ru: \n Переключить поиск неопределенных команд на сервере.\n\n По умолчанию поиск неопределенных команд отключен.\n

source: Fuzzy command search has been {} for this server.
ru_ru: Поиск неопределенной команды был {} для этого сервера.

source: \n Toggle whether to enable fuzzy command search in DMs.\n\n Default is for fuzzy command search to be disabled.\n
ru_ru: \n Переключить поиск неопределенных команд в личных сообщениях.\n\n По умолчанию поиск неопределенных команд отключен.\n

source: Fuzzy command search has been {} in DMs.
ru_ru: Поиск неопределенных команд был {} в личных сообщениях.

source: \n Sets a default colour to be used for the bot's embeds.\n\n Acceptable values for the colour parameter can be found at:\n\n https://discordpy.readthedocs.io/en/stable/ext/commands/api.html#discord.ext.commands.ColourConverter\n
ru_ru: \n Устанавливает цвет по умолчанию, который будет использоваться для встраиваемых сообщений бота.\n\n Приемлемые значения для параметра цвета можно найти по адресу:\n\n https://discordpy.readthedocs.io/en/stable/ext/commands/api.html#discord.ext.commands.ColourConverter\n

source: The color has been reset.
ru_ru: Цвет был сброшен.

source: The color has been set.
ru_ru: Цвет был установлен.

source: Failed. Remember that you can edit my avatar up to two times a hour. The URL or attachment must be a valid image in either JPG or PNG format.
ru_ru: Ошибка. Помните, что мой аватар можно редактировать до двух раз в час. Ссылка или вложение должны быть корректным изображением в формате JPG или PNG.

source: JPG / PNG format only.
ru_ru: JPG / PNG формат только.

source: Removes [botname]'s avatar
ru_ru: Удаляет аватар [botname]

source: Avatar removed.
ru_ru: Аватар удален.

source: Sets [botname]'s playing status
ru_ru: Устанавливает игровой статус [botname]

source: Status set to ``Playing {game.name}``.
ru_ru: Статус изменён на ``Воспроизведение {game.name}``.

source: Game cleared.
ru_ru: Игра очищена.

source: Sets [botname]'s listening status
ru_ru: Устанавливает статус прослушивания [botname]

source: Status set to ``Listening to {listening}``.
ru_ru: Статус установлен в ``Слушаю {listening}``.

source: Listening cleared.
ru_ru: Прослушивание прояснилось.

source: Sets [botname]'s watching status
ru_ru: Устанавливает статус просмотра [botname]

source: Watching cleared.
ru_ru: Просмотр очищен.

source: Sets [botname]'s status\n\n Available statuses:\n online\n idle\n dnd\n invisible\n
ru_ru: Устанавливает статус [botname]\n\n Доступные статусы:\n онлайн\n вхолостую\n просьба не беспокоить\n невидимый\n

source: Status changed to {}.
ru_ru: Статус изменён на {}.

source: Sets [botname]'s streaming status\n Leaving both streamer and stream_title empty will clear it.
ru_ru: Устанавливает потоковое состояние [botname]\n Если оставить как streamer, так и stream_title пустыми, это очистит его.

source: Sets [botname]'s username
ru_ru: Устанавливает имя пользователя [botname]

source: Failed to change name. Remember that you can only do it up to 2 times an hour. Use nicknames if you need frequent changes. `{}set nickname`
ru_ru: Не удалось изменить имя. Помните, что вы можете делать это до 2-ух раз в час. Используйте никнеймы, если вам нужны частые изменения. `{} установить никнейм`

source: Sets [botname]'s nickname
ru_ru: Устанавливает никнейм [botname]

source: I lack the permissions to change my own nickname.
ru_ru: Мне не хватает разрешений чтобы изменить свой ник.

source: Sets [botname]'s global prefix(es)
ru_ru: Устанавливает глобальный префикс(ксы) [botname]

source: Prefix set.
ru_ru: Префикс установлен.

source: Sets [botname]'s server prefix(es)
ru_ru: Устанавливает префикс(ксы) сервера [botname]

source: Guild prefixes have been reset.
ru_ru: Префиксы сервера были сброшены.

source: Invalid language code. Use format: `en-US`
ru_ru: Неверный код языка. Используйте формат: `en-US`

source: Invalid format - language code has to include country code, e.g. `en-US`
ru_ru: Недопустимый формат - код языка должен содержать код страны, например 'en-US'

source: Locale has been set.
ru_ru: Локализация была установлена.

source: Regional formatting will now be based on bot's locale.
ru_ru: Формат региона теперь будет основываться на локализации бота.

source: Regional formatting will now be based on `{language_code}` locale.
ru_ru: Формат региона теперь будет основываться на локализации `{language_code}`.

source: Customizes a section of [p]info\n\n The maximum amount of allowed characters is 1024.\n Supports markdown, links and \"mentions\".\n Link example:\n `[My link](https://example.com)`\n
ru_ru: Настраивает раздел [p]info\n\n Максимально допустимое количество символов - 1024.\n Поддерживает уценку, ссылки и \"mentions\".\n Пример ссылки:\n `[My link](https://example.com)`\n

source: The custom text has been cleared.
ru_ru: Пользовательский текст был очищен.

source: The custom text has been set.
ru_ru: Пользовательский текст установлен.

source: Set various external API tokens.\n\n This setting will be asked for by some 3rd party cogs and some core cogs.\n\n To add the keys provide the service name and the tokens as a comma separated\n list of key,values as described by the cog requesting this command.\n\n Note: API tokens are sensitive and should only be used in a private channel\n or in DM with the bot.\n
ru_ru: Установите различные внешние токены API.\n\n Эта настройка будет запрашиваться некоторыми сторонними винтиками и некоторыми основными винтиками.\n\n Для добавления ключей укажите имя сервиса и токены в виде запятой\n список ключей, значений, как описано Cog, запрашивающим эту команду.\n\n Примечание: токены API чувствительны и должны использоваться только в частном канале\n или в DM с ботом.\n

source: `{service}` API tokens have been set.
ru_ru: `{service}` API токены были установлены.

source: Manage settings for the help command.
ru_ru: Управление настройками для команды справки.

source: \n Allows the help command to be sent as a paginated menu instead of seperate\n messages.\n\n This defaults to False.\n Using this without a setting will toggle.\n
ru_ru: \n Позволяет отправлять команду справки в виде разбитого на страницы меню вместо отдельного\n Сообщения.\n\n По умолчанию это False.\n Использование этого без настройки переключит. \n

source: Help will use menus.
ru_ru: Помощь будет использовать меню.

source: Help will not use menus.
ru_ru: Помощь не будет использовать меню.

source: \n This allows the help command to show hidden commands\n\n This defaults to False.\n Using this without a setting will toggle.\n
ru_ru: \n Это позволяет команде справки показывать скрытые команды\n\n По умолчанию False.\n Использование этого без настройки переключится\n

source: Help will not filter hidden commands
ru_ru: Помощь не будет фильтровать скрытые команды

source: Help will filter hidden commands.
ru_ru: Помощь будет фильтровать скрытые команды.

source: \n Sets if commands which can't be run in the current context should be\n filtered from help\n\n Defaults to True.\n Using this without a setting will toggle.\n
ru_ru: \n Если команды, которые не могут быть запущены в текущем контексте, должны быть\n отфильтрованы из помощи\n\n По умолчанию истина.\n Использование этого без параметра будет переключаться.\n

source: Help will only show for commands which can be run.
ru_ru: Справка будет показывать только для команд, которые могут быть запущены.

source: Help will show up without checking if the commands can be run.
ru_ru: Справка будет показана без проверки возможности выполнения команд.

source: \n This allows the bot to respond indicating the existence of a specific\n help topic even if the user can't use it.\n\n Note: This setting on it's own does not fully prevent command enumeration.\n\n Defaults to False.\n Using this without a setting will toggle.\n
ru_ru: \n Это позволяет боту ответить на сообщение о существовании конкретной\n категории помощи, даже если пользователь не может ее использовать.\n\n Примечание: Эта настройка сама по себе не предотвращает переадресацию команд.\n\n По умолчанию — Ложь.\n Использование этого без параметра будет переключаться.\n

source: Help will verify the existence of help topics.
ru_ru: Помощь проверит наличие тем помощи.
