Repository: pypi-data/pypi-mirror-77
Catalog: packages/Red-DiscordBot/Red_DiscordBot-3.3.12-py3-none-any.whl/redbot/core/locales/*.po
Languages: ru_ru

source: Help will only verify the existence of help topics via fuzzy help (if enabled).
ru_ru: Помощь будет проверять только наличие тем помощи при помощи нечеткой справки (если включено).

source: Set the character limit for each page in the help message.\n\n This setting only applies to embedded help.\n\n The default value is 1000 characters. The minimum value is 500.\n The maximum is based on the lower of what you provide and what discord allows.\n\n Please note that setting a relatively small character limit may\n mean some pages will exceed this limit.\n
ru_ru: Установите ограничение на количество символов для каждой страницы в справочном сообщении.\n\n Этот параметр применяется только к встроенной справке.\n\n Значение по умолчанию составляет 1000 символов. Минимальное значение 500.\n Максимум зависит от того, что вы предоставляете, и того, что позволяет раздор.\n\n Обратите внимание, что установка относительно небольшого ограничения на количество символов может\n означает, что некоторые страницы будут превышать этот предел.\n

source: You must give a value of at least 500 characters.
ru_ru: Значение должно быть не менее 500 символов.

source: Done. The character limit per page has been set to {}.
ru_ru: Готово. Максимальное количество символов на странице было установлено равным {}.

source: You must give a value of zero or greater!
ru_ru: Вы должны дать значение ноль или больше!

source: Done. The page limit has been set to {}.
ru_ru: Готово. Ограничение на количество страниц установлено на {}.

source: Set the delay after which help pages will be deleted.\n\n The setting is disabled by default, and only applies to non-menu help,\n sent in server text channels.\n Setting the delay to 0 disables this feature.\n\n The bot has to have MANAGE_MESSAGES permission for this to work.\n
ru_ru: Установите задержку, после которой страницы справки будут удалены.\n\n По умолчанию настройка отключена, и применяется только к справке, не являющейся меню,\n отправляемой в текстовые каналы сервера.\n Установка задержки в 0 отключает эту возможность.\n\n Бот должен иметь разрешение MANAGE_MESSAGES на работу.\n

source: The delay cannot be longer than 14 days!
ru_ru: Задержка не может быть длиннее 14 дней!

source: Done. Help messages will not be deleted now.
ru_ru: Готово. Сообщения справки теперь не будут удалены.

source: Done. The delete delay has been set to {} seconds.
ru_ru: Готово. Задержка удаления была установлена на {} секунд.

source: \n Set the tagline to be used.\n\n This setting only applies to embedded help. If no tagline is\n specified, the default will be used instead.\n
ru_ru: \n Установите подзаголовок, который будет использоваться.\n\n Этот параметр применяется только к встроенной справке.\n Если лозунг не указан, вместо него будет использоваться\n значение по умолчанию

source: The tagline has been reset.
ru_ru: Подзаголовок был сброшен.

source: Your tagline is too long! Please shorten it to be no more than 2048 characters long.
ru_ru: Ваш подзаголовок слишком длинный! Пожалуйста, уменьшите его до 2048 символов.

source: The tagline has been set.
ru_ru: Подзаголовок был сброшен.

source: User ID: {}
ru_ru: ID пользователя: {}

source: through DM
ru_ru: через DM

source: from {}
ru_ru: от {}

source: | Server ID: {}
ru_ru: | ID сервера: {}

source: Use `{}dm {} <text>` to reply to this user
ru_ru: Используйте `{}dm {} <text>`чтобы ответить пользователю

source: Sent by {} {}
ru_ru: Отправил {} {}

source: I've been configured not to send this anywhere.
ru_ru: Я настроен не отправлять это нигде.

source: Your message has been sent.
ru_ru: Ваше сообщение было отправлено.

source: I'm unable to deliver your message. Sorry.
ru_ru: Я не могу доставить ваше сообщение. Извините.

source: Invalid ID, user not found, or user is a bot. You can only send messages to people I share a server with.
ru_ru: Недопустимый ID, пользователь не найден или пользователь бот. Вы можете отправлять сообщения только тем пользователям, с которыми у меня есть сервер.

source: Owner of {}
ru_ru: Владелец {}

source: You can reply to this message with {}contact
ru_ru: Вы можете ответить на это сообщение с {} контактом

source: Sorry, I couldn't deliver your message to {}
ru_ru: Извините, я не смог доставить сообщение для %s

source: Message delivered to {}
ru_ru: Сообщение доставлено к %s

source: Prints the bot's data path.
ru_ru: Выводит путь к данным бота.

source: Data path: {path}
ru_ru: Путь к данным: {path}

source: Shows debug information useful for debugging..
ru_ru: Показывает отладочную информацию, полезную для отладки..

source: \n Whitelist management commands.\n
ru_ru: \n Команды управления белым списком.\n

source: \n Adds a user to the whitelist.\n
ru_ru: \n Добавляет пользователя в белый список.\n

source: Users added to whitelist.
ru_ru: Пользователь был добавлен в белый список.

source: \n Lists whitelisted users.\n
ru_ru: \n Список пользователей в белом списке.\n

source: Whitelisted Users:
ru_ru: Пользователи в белом списке:

source: \n Removes user from whitelist.\n
ru_ru: \n Удаляет пользователя из белого списка.\n

source: Users have been removed from whitelist.
ru_ru: Пользователь был удалён из белого списка.

source: \n Clears the whitelist.\n
ru_ru: \n Очищает белый список.\n

source: Whitelist has been cleared.
ru_ru: Белый список был очищен.

source: \n Blacklist management commands.\n
ru_ru: \n Команды управления черным списком.\n

source: \n Adds a user to the blacklist.\n
ru_ru: \n Добавляет пользователя в черный список.\n

source: You cannot blacklist an owner!
ru_ru: Вы не можете добавить владельца в чёрный список!

source: User added to blacklist.
ru_ru: Пользователь добавлен в черный список.

source: \n Lists blacklisted users.\n
ru_ru: \n Список пользователей в черном списке.\n

source: Blacklisted Users:
ru_ru: Черный список пользователей:

source: \n Removes user from blacklist.\n
ru_ru: \n Удаляет пользователя из черного списка.\n

source: Users have been removed from blacklist.
ru_ru: Пользователь был удалён из чёрного списка.

source: \n Clears the blacklist.\n
ru_ru: \n Очищает черный список.\n

source: Blacklist has been cleared.
ru_ru: Чёрный список очищен.

source: \n Adds a user or role to the whitelist.\n
ru_ru: \n Добавляет пользователя или роль в белый список.\n

source: {names} added to whitelist.
ru_ru: {names} добавлен в белый список.

source: \n Lists whitelisted users and roles.\n
ru_ru: \n Показывает список пользователей и ролей в белом списке.\n

source: Whitelisted Users and roles:
ru_ru: Пользователи и роли в белом списке:

source: \n Removes user or role from whitelist.\n
ru_ru: \n Удаляет пользователя или роль из белого списка.\n

source: {names} removed from the local whitelist.
ru_ru: {names} удален из локального белого списка.

source: Local whitelist has been cleared.
ru_ru: Локальный белый список был очищен.

source: \n Adds a user or role to the blacklist.\n
ru_ru: \n Добавлять пользователя или роль в чёрный список.\n

source: You cannot blacklist yourself!
ru_ru: Вы не можете добавить себя в черный список!

source: You cannot blacklist a bot owner!
ru_ru: Вы не можете добавить владельца в чёрный список!

source: {names} added to the local blacklist.
ru_ru: {names} добавлен в локальный черный список.

source: \n Lists blacklisted users and roles.\n
ru_ru: \n Показывает список пользователей и ролей в черном списке.\n

source: Blacklisted Users and Roles:
ru_ru: Пользователи и роли в черном списке:

source: \n Removes user or role from blacklist.\n
ru_ru: \n Удаляет пользователя или роль из черного списка.\n

source: {names} removed from the local blacklist.
ru_ru: {names} удален из локального черного списка.

source: Local blacklist has been cleared.
ru_ru: Локальный черный список был очищен.

source: Manage the bot's commands.
ru_ru: Управление командами бота.

source: \n List disabled commands.\n\n If you're the bot owner, this will show global disabled commands by default.\n
ru_ru: \n Список отключенных команд.\n\n Если вы владелец бота, по умолчанию будет показывать глобальные отключенные команды.\n

source: List disabled commands globally.
ru_ru: Список отключенных команд по всему миру.

source: There aren't any globally disabled commands.
ru_ru: Нет глобально отключенных команд.

source: {} commands are disabled globally.\n
ru_ru: {} Команды отключены глобально.\n

source: 1 command is disabled globally.\n
ru_ru: 1 команда отключена глобально.\n

source: List disabled commands in this server.
ru_ru: Список отключенных команд на этом сервере.

source: There aren't any disabled commands in {}.
ru_ru: Нет отключенных комманд в {}.

source: {} commands are disabled in {}.\n
ru_ru: {} команды отключены в {}.\n

source: 1 command is disabled in {}.\n
ru_ru: 1 команда отключена в {}.\n

source: Disable a command.\n\n If you're the bot owner, this will disable commands\n globally by default.\n
ru_ru: Отключите команду.\n\n Если вы владелец бота, это отключит команды\n глобально по умолчанию\n

source: Disable a command globally.
ru_ru: Отключить команду глобально.

source: I couldn't find that command. Please note that it is case sensitive.
ru_ru: Я не мог найти эту команду. Обратите внимание, что она чувствительна к регистру.

source: The command to disable cannot be `command` or any of its subcommands.
ru_ru: Команда отключения не может быть `команда` или ни одной из подкоманд.

source: That command is already disabled globally.
ru_ru: Эта команда уже отключена глобально.

source: Disable a command in this server only.
ru_ru: Отключить команду только на этом сервере.

source: You are not allowed to disable that command.
ru_ru: Вы не можете отключить эту команду.

source: That command is already disabled in this server.
ru_ru: Эта команда уже отключена на этом сервере.

source: Enable a command globally.
ru_ru: Включить команду глобально.

source: That command is already enabled globally.
ru_ru: Эта команда уже включена глобально.

source: Enable a command in this server.
ru_ru: Включить команду на этом сервере.

source: You are not allowed to enable that command.
ru_ru: Вы не можете включить эту команду.

source: That command is already enabled in this server.
ru_ru: Эта команда уже включена на этом сервере.

source: No immunty settings here.
ru_ru: Здесь нет настроек невосприимчивости.

source: Already added.
ru_ru: Уже добавлено.

source: Not in list.
ru_ru: Нет в списке.

source: They are immune
ru_ru: Они невосприимчивы

source: They are not Immune
ru_ru: Они не невосприимчивы

source: \n Commands for configuring owner notifications.\n
ru_ru: \n Команды для настройки уведомлений владельца.\n

source: This server is not in the ignore list.
ru_ru: Этот сервер отсутствует в списке игнорируемых.

source: This server is currently being ignored.
ru_ru: Этот сервер в настоящее время игнорируется.

source: \n Get info about Red's licenses\n
ru_ru: \n Получить информацию о лицензиях Red\n

source: Evaluate a statement of python code.\n\n The bot will always respond with the return value of the code.\n If the return value of the code is a coroutine, it will be awaited,\n and the result of that will be the bot's response.\n\n Note: Only one statement may be evaluated. Using certain restricted\n keywords, e.g. yield, will result in a syntax error. For multiple\n lines or asynchronous code, see [p]repl or [p]eval.\n\n Environment Variables:\n ctx - command invokation context\n bot - bot object\n channel - the current channel object\n author - command author's member object\n message - the command's message object\n discord - discord.py library\n commands - redbot.core.commands\n _ - The result of the last dev command.\n
ru_ru: Оценить утверждение кода Python.\n\n Бот всегда будет отвечать с возвращаемым значением кода.\n Если возвращаемое значение кода является коритином, он будет ожидать,\n и результатом этого будет ответ бота.\n\n Примечание: только одно утверждение может быть оценено. Использование определенных ограниченных\n ключевых слов, напр., приведет к синтаксической ошибке. Для нескольких\n строк или асинхронного кода смотрите [p]repl или [p]eval.\n\n Переменные окружения:\n ctx - контекст вызова команды\n бота - объект бота\n канала - текущий объект канала\n автор - объект участника команды\n сообщение - объект сообщения команды\n discord - discord. y библиотека\n команд - redbot.core. ommands\n _ - Результат последней команды dev.\n

source: Already running a REPL session in this channel. Exit it with `quit`.
ru_ru: Уже выполняется сеанс REPL в этом канале. Выйдите из него с `quit`.

source: Enter code to execute or evaluate. `exit()` or `quit` to exit.
ru_ru: Введите код для выполнения или оценки. `exit()` или `quit` чтобы выйти.

source: Unexpected error: `{}`
ru_ru: Непредвиденная ошибка: `{}`

source: Moderator
ru_ru: Модератор
