Repository: pypi-data/pypi-mirror-77
Catalog: packages/collective.revisionmanager/collective.revisionmanager-1.0.0.tar.gz/collective.revisionmanager-1.0.0/src/collective/revisionmanager/locales/*/LC_MESSAGES/collective.revisionmanager.po
Languages: de, es, pt_br

source: Are you sure?
de: Sind Sie sicher?
es: ¿Está seguro?
pt_br: Tem certeza?

source: Delete orphans
de: Historien ohne Arbeitskopie löschen
es: Eliminar huérfanos
pt_br: Apagar órfanos

source: Depending on the number of objects in your database, calculating the statistics can consume a lot of memory. Setting a subtransaction threshold will reduce memory requirements at the expense of speed. The default (0) is to not use subtransactions.
de: Bei vielen Objekten in der Datenbank ist die Berechnung der Statistik mit hohem Speicherverbrauch verbunden. Subtransaktionen reduzieren den Speicherverbrauch, die Berechnung dauert dann aber länger. Standardmäßig (0) werden keine Subtransaktionen verwendet.
es: En dependencia del número de objetos en su base de datos, calcular las estadísticas puede consumir mucha memoria. Especificando un umbral para sub-transacciones reduce los requerimientos de memoria a expensas de la velocidad. El valor por defecto (0), indica que no serán usadas sub-transacciones.
pt_br: Dependendo do número de objetos no banco de dados, o cálculo das estadísticas pode consumir muita memória. Colocando um valor limite para sub-transações reduz os requerimentos de memória a expensas da velocidade. O valor padrão (0) evita o uso de sub-transações.

source: Installs the collective.revisionmanager add-on.
de: Installiert collective.revisionmanager
es: Instala collective.revisionmanager.
pt_br: Instalar collective.revisionmanager.

source: Purge selected histories
de: Ausgewählte Historien bereinigen
es: Purgar las historias seleccionadas
pt_br: Purgar os históricos selecionados

source: Recalculate Statistics
de: Statistik neu berechnen
es: Recalcular estadísticas
pt_br: Recalcular estadísticas

source: Revision history settings for this site.
de: Versionierungseinstellungen für diese Site.
es: Configuración del historial de revisiones de este sitio.
pt_br: Configuração do histórico de revisões do site.

source: Revision settings
de: Versionierungseinstellungen
es: Configuración de revisiones
pt_br: Configuração de revisões

source: Save
de: Speichern
es: Guardar
pt_br: Guardar

source: Select all
de: Alle auswählen
es: Seleccionar todo
pt_br: Selecionar tudo.

source: Site Setup
de: Konfiguration
es: Configuración del sitio
pt_br: Configuração do site

source: Subtransaction threshold for statistics calculation
de: Anzahl Historien, bei denen jeweils eine Subtransaktion abgeschlossen wird
es: Umbral de sub-transacciones para cálculo de estadísticas
pt_br: Limite de sub-transações para o cálculo das estadísticas.

source: Uninstall collective.revisionmanager.
es: Desinstala collective.revisionmanager.
pt_br: Desinstalar collective.revisionmanager.

source: approximate
de: Näherung
es: aproximado
pt_br: aproximado

source: calculation_time_label
de: Die Berechnung der Statistik erfolgte in ${calculation_time} Sekunden.
es: El cálculo de las estadísticas tomó ${calculation_time} segundos,
pt_br: O cálculo das estadísticas demorou ${calculation_time} segundos.

source: heading_average_versions
de: Mittlere Anzahl Versionen pro Historie:
es: Número promedio de versiones por historia.
pt_br: Número promédio de versões por histórico.

source: heading_current_path
de: Arbeitskopiepfad
es: ruta actual (desde la raíz del sitio)"
pt_br: path atual (começando pela raiz do site)"

source: heading_deleted_items
de: von gelöschten Dokumenten:
es: de objetos eliminados.
pt_br: de itens eliminados.

source: heading_existing_items
de: von Dokumenten mit Arbeitskopie:
es: de objetos existentes.
pt_br: de itens existentes.

source: heading_history_id
de: Historien-ID
es: ID del historial
pt_br: ID do histórico

source: heading_histstorage_contents
de: Historien
es: Contenido del storage de historial
pt_br: Conteúdo do storage de históricos

source: heading_num_histories
de: Anzahl Historien:
es: Número de historias.
pt_br: Número de históricos.

source: heading_num_versions
de: Anzahl Versionen:
es: Número de versiones.
pt_br: Número de versões.

source: heading_portal_type
de: Objekttyp
es: tipo de contenido
pt_br: tipo de conteúdo

source: heading_revisions_settings
de: Versionierungs-Einstellungen
es: Configuración de la revisión
pt_br: Configuração de revisões

source: heading_size
de: Größe
es: tamaño
pt_br: tamanho

source: heading_size_state
de: Größenberechnung
es: estado del tamaño
pt_br: estado do tamanho

source: heading_versions
es: versiones (purgadas)
pt_br: versões (purgadas)

source: inaccurate
de: ungenau
es: inexacto
pt_br: impreciso

source: label_delete_orphans
de: Alle Historien ohne Arbeitskopie löschen:
es: Eliminar todas los historiales sin copias de trabajo.
pt_br: Eliminar todos os históricos sem cópia de trabalho.

source: label_histories
de: Liste aller Historien
es: Listar historiales
pt_br: Listar históricos

source: label_num_revisions_to_keep
de: Anzahl Revisionen, die beibehalten werden sollen (0: Historie wird komplett gelöscht):
es: Número de revisiones que serán mantenidas (0 para eliminar el historial completo):
pt_br: Número de revisões que serão mantidas (0 para eliminar todo o histórico);

source: label_revisions_settings
de: Versionierungs-Einstellungen
es: Configuración
pt_br: Configurações

source: last_updated_label
de: Zeitpunkt der letzten Aktualisierung der Statistik: ${last_updated_timestamp}
es: Estadísticas calculadas ${last_updated_timestamp}
pt_br: Estadísticas calculadas ${last_updated_timestamp}

source: maximum number of versions to keep in the storage (set to -1 for infinite)
de: maximale Anzahl an Versionen, die aufbewahrt werden sollen (-1: es werden unbegrenzt neue Versionen angelegt)
es: número máximo de versiones que serán mantenidas en el storage (use -1 para infinitas)
pt_br: número máximo de versões que serão mantidas no storage (use -1 para infinitas)

source: no_summary_label
de: Keine Statistik verfügbar. Betätigen Sie die Schaltfläche unten, um die Statistik zu berechnen.
es: No existen estadísticas disponibles. Presiones el botón para calcular las estadísticas.
pt_br: No ha estadísticas disponíveis. Pressione o botão para calculá-las.

source: number of versions to keep
de: Anzahl Versionen, die aufbewahrt werden sollen
es: número de versiones a mantener
pt_br: número de versões que serão mantidas

source: text_not_allowed_manage_server
es: Usted no tiene permiso para administrar el servidor Zope.
pt_br: Você não tem permissão para gerenciar o servidor Zope.

source: unknown
de: unbekannt
es: desconocido
pt_br: desconhecido
