Repository: pypi-data/pypi-mirror-77
Catalog: packages/collective.testimony/collective.testimony-1.0a1.tar.gz/collective.testimony-1.0a1/src/collective/testimony/locales/*/LC_MESSAGES/collective.testimony.po
Languages: fr

source: Displayed Function
fr: Fonction affichée

source: Domain
fr: Domaine

source: First name
fr: Prénom

source: Function
fr: Fonction

source: Function displayed on results / testimonies
fr: Fonction affichée dans les témoignages et résultats de recherche

source: Function for search filters (gender-inclusive)
fr: Fonction présentée comme filtre de recherche (inclusive)

source: In the random testimony?
fr: Est-ce un témoignage aléatoire

source: Testimony
fr: Témoignage

source: Textual testimony
fr: Témoignage textuel

source: Theme
fr: Thème

source: URL address of the video
fr: URL de la vidéo

source: Video transcript
fr: Transcription de la vidéo
