Repository: pypi-data/pypi-mirror-77
Catalog: packages/Red-DiscordBot/Red_DiscordBot-3.3.12-py3-none-any.whl/redbot/cogs/admin/locales/*.po
Languages: ru_ru

source: I attempted to do something that Discord denied me permissions for. Your command failed to successfully complete.
ru_ru: Я попыталась сделать что-то, в чем Discord отказал мне в разрешениях. Ваша команда не была выполнена успешно.

source: I can not give {role.name} to {member.display_name} because that role is higher than or equal to my highest role in the Discord hierarchy.
ru_ru: Невозможно выдать роль {role.name} для {member.display_name}, потому что эта роль выше или равна моей самой высокой роли в иерархии Discord.

source: I can not remove {role.name} from {member.display_name} because that role is higher than or equal to my highest role in the Discord hierarchy.
ru_ru: Я не могу убрать {role.name} у {member.display_name}, потому что эта роль выше или равна моей самой высокой роли в иерархии Discord.

source: I can not edit {role.name} because that role is higher than my or equal to highest role in the Discord hierarchy.
ru_ru: Я не могу редактировать {role.name}, потому что эта роль выше моей или равна самой высокой роли в иерархии Discord.

source: I can not let you give {role.name} to {member.display_name} because that role is higher than or equal to your highest role in the Discord hierarchy.
ru_ru: Я не могу вам дать {role.name}, {member.display_name}, поскольку эта роль выше или равна вашей самой высокой роли в иерархии Discord.

source: I can not let you remove {role.name} from {member.display_name} because that role is higher than or equal to your highest role in the Discord hierarchy.
ru_ru: Я не могу позволить вам удалить {role.name} у {member.display_name}, потому что эта роль выше или равна вашей самой высокой роли в иерархии Discord.

source: I can not let you edit {role.name} because that role is higher than or equal to your highest role in the Discord hierarchy.
ru_ru: Я не могу позволить вам редактировать {role.name}, потому что эта роль больше или равна вашей самой высокой роли в иерархии Discord.

source: I need manage roles permission to do that.
ru_ru: Мне нужно управлять правами ролей, чтобы сделать это.

source: I am already announcing something. If you would like to make a different announcement please use `{prefix}announce cancel` first.
ru_ru: Я уже что-то объявляю. Если вы хотите сделать другое объявление, сначала используйте `{prefix}announce cancel`.

source: A collection of server administration utilities.
ru_ru: Набор утилит администрирования сервера.

source: {member.display_name} already has the role {role.name}.
ru_ru: {member.display_name} уже имеет роль {role.name}.

source: I successfully added {role.name} to {member.display_name}
ru_ru: Я успешно добавила роль {role.name} пользователю {member.display_name}

source: {member.display_name} does not have the role {role.name}.
ru_ru: {member.display_name} не имеет роли {role.name}.

source: I successfully removed {role.name} from {member.display_name}
ru_ru: Я успешно забрала роль {role.name} у пользователя {member.display_name}

source: \n Add a role to a user.\n\n Use double quotes if the role contains spaces.\n If user is left blank it defaults to the author of the command.\n
ru_ru: \n Добавить роль пользователю.\n\n Используйте двойные кавычки, если роль содержит пробелы.\n Если пользователь не указан, по умолчанию используется автор команды.\n

source: \n Remove a role from a user.\n\n Use double quotes if the role contains spaces.\n If user is left blank it defaults to the author of the command.\n
ru_ru: \n Удалить роль у пользователя.\n\n Используйте двойные кавычки, если роль содержит пробелы.\n Если пользователь не указан, по умолчанию используется автор команды.\n

source: Edit role settings.
ru_ru: Изменение параметров роли.

source: \n Edit a role's colour.\n\n Use double quotes if the role contains spaces.\n Colour must be in hexadecimal format.\n [Online colour picker](http://www.w3schools.com/colors/colors_picker.asp)\n\n Examples:\n `[p]editrole colour \"The Transistor\" #ff0000`\n `[p]editrole colour Test #ff9900`\n
ru_ru: \n Изменить цвет роли.\n\n Используйте двойные кавычки, если роль содержит пробелы.\n Цвет должен быть в шестнадцатеричном формате.\n [Онлайн-палитра цветов](http://www.w3schools.com/colors/colors_picker.asp)\n\n Примеры:\n `[p]editrole colour \"The Transistor\" #ff0000`\n `[p]editrole colour Test #ff9900`\n

source: Done.
ru_ru: Готово.

source: \n Edit a role's name.\n\n Use double quotes if the role or the name contain spaces.\n\n Example:\n `[p]editrole name \"The Transistor\" Test`\n
ru_ru: \n Изменить название роли.\n\n Используйте двойные кавычки, если роль или имя содержат пробелы.\n\n Примеры:\n `[p]editrole name \"The Transistor\" Test`\n

source: Announce a message to all servers the bot is in.
ru_ru: Объявить сообщение на всех серверах, к которым подключен бот.

source: The announcement has begun.
ru_ru: Объявление началось.

source: Cancel a running announce.
ru_ru: Отменить текущее объявление.

source: There is no currently running announcement.
ru_ru: В данный момент нет запущенных объявлений.

source: The current announcement has been cancelled.
ru_ru: Текущее объявление было отменено.

source: Change how announcements are sent in this guild.
ru_ru: Изменить способ отправки объявлений на этом сервере.

source: \n Change the channel where the bot will send announcements.\n \n If channel is left blank it defaults to the current channel.\n
ru_ru: \n Изменить канал, в котором бот будет отправлять объявления.\n \n Если канал не указан, по умолчанию используется текущий канал.\n

source: The announcement channel has been set to {channel.mention}
ru_ru: Канал объявления был установлен на {channel.mention}

source: Toggle announcements being enabled this server.
ru_ru: Переключить объявления, когда этот сервер включен.

source: The server {guild.name} will receive announcements.
ru_ru: Сервер {guild.name} будет получать объявления.

source: The server {guild.name} will not receive announcements.
ru_ru: Сервер {guild.name} не будет получать объявления.

source: Apply selfroles.
ru_ru: Применить свои роли.

source: \n Add a selfrole to yourself.\n\n Server admins must have configured the role as user settable.\n NOTE: The role is case sensitive!\n
ru_ru: \n Добавить собственную роль себе.\n\n Администраторы сервера должны настроить роль как устанавливаемую пользователем.\n ПРИМЕЧАНИЕ: Роль чувствительна к регистру!\n

source: \n Remove a selfrole from yourself.\n\n Server admins must have configured the role as user settable.\n NOTE: The role is case sensitive!\n
ru_ru: \n Удалить собственную роль у себя.\n\n Администраторы сервера должны настроить роль как устанавливаемую пользователем.\n ПРИМЕЧАНИЕ: Роль чувствительна к регистру!\n

source: \n Lists all available selfroles.\n
ru_ru: \n Список всех доступных Собственных ролей.\n

source: Available Selfroles:\n{selfroles}
ru_ru: Доступные собственные роли:\n{selfroles}

source: Manage selfroles.
ru_ru: Управление своими ролями.

source: \n Add a role to the list of available selfroles.\n\n NOTE: The role is case sensitive!\n
ru_ru: \n Добавить роль в список доступных своих ролей.\n\n ПРИМЕЧАНИЕ: Роль чувствительна к регистру!\n

source: I cannot let you add {role.name} as a selfrole because that role is higher than or equal to your highest role in the Discord hierarchy.
ru_ru: Нельзя добавить {role.name} в качестве собственной роли, потому что эта роль выше или равна вашей самой высшей роли в иерархии Discord.

source: Added.
ru_ru: Добавлено.

source: That role is already a selfrole.
ru_ru: У вас уже имеется эта роль.

source: \n Remove a role from the list of available selfroles.\n\n NOTE: The role is case sensitive!\n
ru_ru: \n Удалить роль из списка доступных собственных ролей.\n\n ПРИМЕЧАНИЕ: Роль чувствительна к регистру!\n

source: I cannot let you remove {role.name} from being a selfrole because that role is higher than or equal to your highest role in the Discord hierarchy.
ru_ru: Вы не можете забрать у себя роль {role.name}, потому что эта роль выше или равна вашей самой высокой роли в иерархии Discord.

source: Removed.
ru_ru: Удалено.

source: Lock a bot to its current servers only.
ru_ru: Зафиксировать бота только на его текущих серверах.

source: The bot is no longer serverlocked.
ru_ru: Бот больше не зафиксирован на сервере.

source: The bot is now serverlocked.
ru_ru: Бот теперь зафиксирован на сервере.

source: I could not announce to the following server:
ru_ru: Я не могу сделать объявление на следующем сервере:

source: I could not announce to the following servers:
ru_ru: Я не могу сделать объявление на следующих серверах:

source: The Admin cog is not loaded.
ru_ru: Модуль Admin не загружен.

source: The provided role is not a valid selfrole.
ru_ru: Предоставленная роль не является допустимой ролью.
